status/src/2022/0422.org
#+TITLE: 16 April 2022 - 22 April 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Session 51-54
** 8.01X+8.01L - Physics I - Classical Mechanics with Labs
*** Started Problem Set 2
*** Planning experiment to measure 'g'
** 21G.701 Spanish
*** Finished Episodes 30-31
* Mill Controller #2
** Potential for using old Compaq iPaq boards.
** May use OLPC in the meantime.
** Still having problems with mill controller booting reliably.
   Needs a new RTC battery.
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Virtual Orchestra
** Continued Bolero coding
** Initial playback using fluidsynth
   Awful, unless you *wanted* the bass clarinets to sound like farts.
** Have strategy for large instruments sets
   Generate audio for each instrument separately (via csound) and
   generate mix script for some DAW (ardour?). This is going to be a
   ton of work just to get to the point of deciding if this is going
   to be satisfactory approach.
* Quilting Frame Desk
** Edge Banding in glue-up
** Tapped holes in leg brackets
** Started leg brace design completed.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 4/29/2022.
* Peter Kim
** Broadcom CSG Employee indicted for trade secret theft.
** United States v. Kim (5:21-cr-00438).
** Change of Plea Hearing set for 5/31/2022

