status/2022/0422.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-30 Sat 06:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>16 April 2022 - 22 April 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">16 April 2022 - 22 April 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc1d59eb">1. MIT OCW</a>
<ul>
<li><a href="#org868aca5">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org11a1b9c">1.1.1. Session 51-54</a></li>
</ul>
</li>
<li><a href="#orga308185">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org7443524">1.2.1. Started Problem Set 2</a></li>
<li><a href="#org7ca02b7">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#org09d5a65">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#orgeb70080">1.3.1. Finished Episodes 30-31</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org26227f2">2. Mill Controller #2</a>
<ul>
<li><a href="#org07a32dc">2.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#org6f3c25c">2.2. May use OLPC in the meantime.</a></li>
<li><a href="#org822ed13">2.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#org7827e83">3. OLPC</a>
<ul>
<li><a href="#org9f639bc">3.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgd300c19">4. Virtual Orchestra</a>
<ul>
<li><a href="#org8693f37">4.1. Continued Bolero coding</a></li>
<li><a href="#orgffd50b6">4.2. Initial playback using fluidsynth</a></li>
<li><a href="#orgd8e17e3">4.3. Have strategy for large instruments sets</a></li>
</ul>
</li>
<li><a href="#org82c8a21">5. Quilting Frame Desk</a>
<ul>
<li><a href="#org44a3e5a">5.1. Edge Banding in glue-up</a></li>
<li><a href="#orgdf3d7dc">5.2. Tapped holes in leg brackets</a></li>
<li><a href="#org9c4d5dc">5.3. Started leg brace design completed.</a></li>
</ul>
</li>
<li><a href="#org33e1099">6. David Davies</a>
<ul>
<li><a href="#org80bfbca">6.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgca368f5">6.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orga12b43c">6.3. Next hearing 4/29/2022.</a></li>
</ul>
</li>
<li><a href="#orga7a1338">7. Peter Kim</a>
<ul>
<li><a href="#orgaeb5dd5">7.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org388c738">7.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org7c5af2b">7.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1d59eb" class="outline-2">
<h2 id="orgc1d59eb"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org868aca5" class="outline-3">
<h3 id="org868aca5"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org11a1b9c" class="outline-4">
<h4 id="org11a1b9c"><span class="section-number-4">1.1.1</span> Session 51-54</h4>
</div>
</div>
<div id="outline-container-orga308185" class="outline-3">
<h3 id="orga308185"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7443524" class="outline-4">
<h4 id="org7443524"><span class="section-number-4">1.2.1</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-org7ca02b7" class="outline-4">
<h4 id="org7ca02b7"><span class="section-number-4">1.2.2</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-org09d5a65" class="outline-3">
<h3 id="org09d5a65"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgeb70080" class="outline-4">
<h4 id="orgeb70080"><span class="section-number-4">1.3.1</span> Finished Episodes 30-31</h4>
</div>
</div>
</div>
<div id="outline-container-org26227f2" class="outline-2">
<h2 id="org26227f2"><span class="section-number-2">2</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org07a32dc" class="outline-3">
<h3 id="org07a32dc"><span class="section-number-3">2.1</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-org6f3c25c" class="outline-3">
<h3 id="org6f3c25c"><span class="section-number-3">2.2</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org822ed13" class="outline-3">
<h3 id="org822ed13"><span class="section-number-3">2.3</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Needs a new RTC battery.
</p>
</div>
</div>
</div>
<div id="outline-container-org7827e83" class="outline-2">
<h2 id="org7827e83"><span class="section-number-2">3</span> OLPC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9f639bc" class="outline-3">
<h3 id="org9f639bc"><span class="section-number-3">3.1</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgd300c19" class="outline-2">
<h2 id="orgd300c19"><span class="section-number-2">4</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8693f37" class="outline-3">
<h3 id="org8693f37"><span class="section-number-3">4.1</span> Continued Bolero coding</h3>
</div>
<div id="outline-container-orgffd50b6" class="outline-3">
<h3 id="orgffd50b6"><span class="section-number-3">4.2</span> Initial playback using fluidsynth</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Awful, unless you <b>wanted</b> the bass clarinets to sound like farts.
</p>
</div>
</div>
<div id="outline-container-orgd8e17e3" class="outline-3">
<h3 id="orgd8e17e3"><span class="section-number-3">4.3</span> Have strategy for large instruments sets</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Generate audio for each instrument separately (via csound) and
generate mix script for some DAW (ardour?). This is going to be a
ton of work just to get to the point of deciding if this is going
to be satisfactory approach.
</p>
</div>
</div>
</div>
<div id="outline-container-org82c8a21" class="outline-2">
<h2 id="org82c8a21"><span class="section-number-2">5</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org44a3e5a" class="outline-3">
<h3 id="org44a3e5a"><span class="section-number-3">5.1</span> Edge Banding in glue-up</h3>
</div>
<div id="outline-container-orgdf3d7dc" class="outline-3">
<h3 id="orgdf3d7dc"><span class="section-number-3">5.2</span> Tapped holes in leg brackets</h3>
</div>
<div id="outline-container-org9c4d5dc" class="outline-3">
<h3 id="org9c4d5dc"><span class="section-number-3">5.3</span> Started leg brace design completed.</h3>
</div>
</div>
<div id="outline-container-org33e1099" class="outline-2">
<h2 id="org33e1099"><span class="section-number-2">6</span> David Davies</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org80bfbca" class="outline-3">
<h3 id="org80bfbca"><span class="section-number-3">6.1</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgca368f5" class="outline-3">
<h3 id="orgca368f5"><span class="section-number-3">6.2</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orga12b43c" class="outline-3">
<h3 id="orga12b43c"><span class="section-number-3">6.3</span> Next hearing 4/29/2022.</h3>
</div>
</div>
<div id="outline-container-orga7a1338" class="outline-2">
<h2 id="orga7a1338"><span class="section-number-2">7</span> Peter Kim</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgaeb5dd5" class="outline-3">
<h3 id="orgaeb5dd5"><span class="section-number-3">7.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org388c738" class="outline-3">
<h3 id="org388c738"><span class="section-number-3">7.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org7c5af2b" class="outline-3">
<h3 id="org7c5af2b"><span class="section-number-3">7.3</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-04-30 Sat 06:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
